const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=>{
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
// 100 + 5 เท่ากับ ?
test('100 + 5 เท่ากับ 105', ()=>{
  expect(sum(100,5)).toBe(105);
})

//21 + 4 เท่ากับ ?
test('21 + 4 เท่ากับ 25', ()=>{
  expect(sum(21,4)).toBe(25);
});

//329 + 71 เท่ากับ ?
test('329 + 71 เท่ากับ 400', ()=>{
  expect(sum(329,71)).toBe(400);
});